<?php


$gachaSets = [
    1  => [ 'gachaMode'=>'通常'            , 'gachaType' => '通常'     ],
    2  => [ 'gachaMode'=>'通常'            , 'gachaType' => '通常'     ],
    3  => [ 'gachaMode'=>'武将星3〜4確定'  , 'gachaType' => '武将確定' ],
    4  => [ 'gachaMode'=>'通常'            , 'gachaType' => '通常'     ],
    5  => [ 'gachaMode'=>'宝箱星3〜4箱確定', 'gachaType' => '宝箱確定' ],
    6  => [ 'gachaMode'=>'通常'            , 'gachaType' => '通常'     ],
    7  => [ 'gachaMode'=>'武将星4確定'     , 'gachaType' => '武将確定' ],
    8  => [ 'gachaMode'=>'通常'            , 'gachaType' => '通常'     ],
    9  => [ 'gachaMode'=>'宝箱星4箱確定'   , 'gachaType' => '宝箱確定' ],
    10 => [ 'gachaMode'=>'宝箱星5箱確定'   , 'gachaType' => '宝箱確定' ],
];

$gachaTypeSlots = [
    "武将確定" => [
        ['確率'=>100,  'slots' => ['武将'=> 1,'武運'=> 3, 'アイテム'=> 2, '宝箱'=> 0 ]]
    ],
    "宝箱確定" => [
        ['確率'=>100,  'slots' => ['武将'=> 0,'武運'=> 5, 'アイテム'=> 0, '宝箱'=> 1 ]]
    ],
    "通常"     => [
        ['確率'=>10.5, 'slots' => ['武将'=> 0,'武運'=> 2, 'アイテム'=> 4, '宝箱'=> 0 ]],
        ['確率'=>35.0, 'slots' => ['武将'=> 0,'武運'=> 3, 'アイテム'=> 3, '宝箱'=> 0 ]],
        ['確率'=>24.5, 'slots' => ['武将'=> 0,'武運'=> 4, 'アイテム'=> 2, '宝箱'=> 0 ]],
        ['確率'=> 4.5, 'slots' => ['武将'=> 1,'武運'=> 2, 'アイテム'=> 3, '宝箱'=> 0 ]],
        ['確率'=>15.0, 'slots' => ['武将'=> 1,'武運'=> 3, 'アイテム'=> 2, '宝箱'=> 0 ]],
        ['確率'=>10.5, 'slots' => ['武将'=> 1,'武運'=> 4, 'アイテム'=> 1, '宝箱'=> 0 ]],
    ],
];

